{"Bible-Notes":{"title":"Bible Notes","links":["Water-Baptism","Forgiving-Sin"],"tags":[],"content":"\nWater Baptism\nForgiving Sin\n"},"Books":{"title":"Books","links":[],"tags":["API"],"content":"My book list. This is a work in progress.\nGetting to it list\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTitleAuthorEvangelical Exodus: Evangelical Seminarians and Their Paths to RomeDouglas BeaumontMan’s Search for MeaningViktor E. FranklHow to Take Smart Notes: One Simple Technique to Boost Writing, Learning and ThinkingSönke AhrensBuilding a Second Brain: A Proven Method to Organize Your Digital Life and Unlock Your Creative PotentialTiago ForteNo Price too High: A Pentecostal Preacher Becomes Catholic []Alex Jones (not the Infowars guy)Columbus and the Quest for Jerusalem: How Religion Drove the Voyages that Led to AmericaCarol DelaneyThe White Pill: A Tale of Good and EvilMichael MaliceDear Reader:The Unauthorized Autobiography of Kim Jong IlMichael MaliceThe Complete 54-Book Apocrypha: 2022 Edition With the Deuterocanon, 1-3 Enoch, Giants, Jasher, Jubilees, Pseudepigrapha, &amp; the Apostolic FathersCovenant PressThe Problem of PainC. S. LewisA Canticle for LeibowitzWalter M. Miller JrThe Early Christians: In Their Own WordsThe Pre Nicean FathersThe Power of the PowerlessVaclav HavelI Don’t Have Enough Faith to Be an AtheistFrank Turek &amp;  Norman L. GeislerThe Poor FolkFyodor DostoevskyThe Brothers KaramazovFyodor Dostoevsky\nIn queue\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTitleAuthorTreasury’s War: The Unleashing of a New Era of Financial WarfareJuan ZarateThe Apostolic Fathers: A New Translation (Lexham Classics)Rick Brannan\nDone\n\n\n\n\n\n\n\n\n\n\n\n\n\nTitleAuthorAmerican Kingpin: The Epic Hunt for the Criminal Mastermind Behind the Silk RoadNick Bilton"},"Break-Up-The-States":{"title":"Break Up The States","links":[],"tags":[],"content":""},"End-Policing-For-Profit":{"title":"End Policing For Profit","links":[],"tags":[],"content":""},"End-Policing,-Start-Sheriffing":{"title":"End Policing, Start Sheriffing","links":[],"tags":[],"content":""},"Exploring-MysticBBS":{"title":"Exploring MysticBBS","links":[],"tags":[],"content":"Exploring MysticBBS: A Nostalgic Dive into BBS Software\nIntroduction\nMystic BBS revives the charm of MS-DOS Bulletin Board Systems (BBS) for modern and vintage tech enthusiasts alike. This software bridges the gap between the simplicity of text-based communication and the complexity of today’s social media platforms. My journey began with a quest to rediscover the roots of online communication, from the firsthand use of a BBS to setting one up. Let’s explore what makes Mystic BBS stand out in an era dominated by graphical user interfaces and why it’s still relevant (or not) for users today.\nKey Features\nMystic BBS distinguishes itself with features that are a breath of fresh air in today’s ad-driven internet landscape:\n\nPure Text Experience: Embrace the clarity and simplicity of plain text.\nPrivacy-Focused: No bots, trackers, or intrusive analytics.\nAd-Free Environment: Enjoy content without distractions.\n\nSetup and Configuration\nGetting Mystic BBS up and running on an Ubuntu LXC container was straightforward. The process, detailed on their installation guide, involved downloading the package, following simple instructions, and configuring firewall rules. My goal was to dive into the BBS experience with minimal fuss, focusing on the essence of communication over customization, so this review will not go into detail on this.\nPerformance\nMystic BBS is impressively lightweight, capable of running on anything from a modern server to a vintage 486 laptop. This flexibility demonstrates its efficiency and the low barrier to entry in terms of hardware requirements.\nSoftware and User Experience\nThe true test came with posting a message. Despite the simplicity of text-based interaction, the challenge lies in introducing contemporary users to Telnet or SSH—technologies far removed from today’s intuitive graphical interfaces. The process, while straightforward to the tech-savvy, poses a significant hurdle to less technical users, underscoring a gap between the ease of use and accessibility.\nPros and Cons\nPros:\n\nFree and Open Source.\nSimple setup with minimal hardware requirements.\nPrivacy-focused and ad-free.\n\nCons:\n\nNot user-friendly for those unfamiliar with command-line interfaces or older technologies.\n\nConclusion and Rating\nMysticBBS stands as a testament to the enduring appeal of BBS systems, offering a niche platform for enthusiasts of retro computing and privacy-conscious users. While it excels in simplicity and privacy, its accessibility barriers limit its appeal to a broader audience. MysticBBS is a niche haven for the tech-savvy elite, reminiscent of communities like Arch Linux and DWM users. For the general public, however, its complexities make it less recommendable.\nRating: 🌟🌟 (2/5 Stars)\nFor its targeted audience, MysticBBS is unparalleled; for the mainstream, it remains a curiosity."},"Forgiving-Sin":{"title":"Forgiving Sin","links":[],"tags":[],"content":"John 20:21-23 (KJV)\n21 Then said Jesus to them again,  Peace be unto you: as my Father hath sent me, even so send I you.\n22 And when he had said this, he breathed on them, and saith unto them,  Receive ye the Holy Ghost:\n23 Whose soever sins ye remit, they are remitted unto them; and whose soever sins ye retain, they are retained."},"Idaho-SB1291--and--SB1317":{"title":"Idaho SB1291 & SB1317","links":[],"tags":[],"content":"The problem with this approach is that it is a double-edged sword that is being wielded by a 900 lbs gorilla.\nhttps://www.youtube.com/watch?v=uahVZP-tSQw&amp;t=298s\nhttps://legislature.idaho.gov/wp-content/uploads/sessioninfo/2024/legislation/S1291.pdf\nhttps://legislature.idaho.gov/wp-content/uploads/sessioninfo/2024/legislation/S1317.pdf\nResources:\n"},"Jury-Nullification":{"title":"Jury Nullification","links":[],"tags":[],"content":""},"News-Sites":{"title":"News Sites","links":[],"tags":[],"content":"Sites I visit for news and information. I use Newsify for my RSS reader. It’s as close to the long dead Google Reader as you can get.\nNews, Economics, OpEd\n\nLew Rockwell\nZeroHedge\nMises Wire\nShenandoah - John Galt FLA\nThe Blaze\nBreitbart News\n\nCrypto News\n\nCointelegraph\nThe Daily HODL\n\nWorld News\n\nRT\n\n"},"Nullification---The-Rightful-Remedy":{"title":"Nullification - The Rightful Remedy","links":[],"tags":[],"content":""},"Obsidian":{"title":"Obsidian","links":[],"tags":[],"content":"Around 2005 or 2006 I discovered org-mode for emacs . I was my sole reason for moving from Vim to emacs. For the last approximately 19 years I have used emacs as my daily driver for note taking. It took me a solid month to get comfortable using emacs. As anyone who has used it will tell you there is a huge learning curve. However once you “get it” you end up wanting to use it for nearly everything.\nI used Org-Mode to organize my thoughts. I used emacs to send and receive email. That only lasted for a day or two. I have used it on and off for calendering, playing mp3’s, listening to Shoutcast streams, RoamNotes, and as an RSS reader and web browser. Oh, and yes I used it as my IDE.\nThat is until I found Obsidian\nI found Obsidian to be the best note taking application I have come across. The follow the philosophy of “future proof your work”. What does that mean? Just like my beloved emacs, they use plain text files. Your notes although they will be displayed and entered in a beautiful manner, are nothing more than old fashioned ASCII files. ASCII files will be able to be read for the next 10,000 years.\nThis website was cobbled together using Obsidian and a plugin called Quartz (see the footer for the link). This site is hosted on Github and when my changes are pushed up to Git, the site gets deployed automatically.\nObsidian used as a blog publishing platform is cool. However where it really shines is taking notes and helping to organize your thoughts. To really get an understanding of what Obsidian is check out this YouTube Playlist Obsidian for Beginners"},"Personal-Nullification,-AKA-Civil-Disobedience":{"title":"Personal Nullification, AKA Civil Disobedience","links":[],"tags":[],"content":""},"Repeal-The-House-Permanent-Apportionment-Act-of-1929":{"title":"Repeal The House Permanent Apportionment Act of 1929","links":[],"tags":[],"content":""},"Residency-Restrictions":{"title":"Residency Restrictions","links":[],"tags":[],"content":""},"Water-Baptism":{"title":"Water Baptism","links":[],"tags":[],"content":"Today Russel Brand is getting baptized. As such the world of Protestantism has plenty to say on the matter. One such comment on the matter is below.\n\nSomeone commented this on the post above:\nBaptism Means nothing if He has not placed his faith in the finished work of Jesus Christ and repented of his sins. If he has, then praise God. I love Russell Brand, one of the smartest and funniest guys out there.\nFriend, you have this backwards.\nJames 2:14:\nWhat shall it profit, my brethren, if a man say he hath faith, but hath not works? Shall faith be able to save him?\nJames 2:15:\nAnd if a brother or sister be naked and want daily food:\nJames 2:16:\nAnd one of you say to them: Go in peace, be ye warmed and filled; yet give them not those things that are necessary for the body, what shall it profit?\nJames 2:17:\nSo faith also, if it have not works, is dead in itself.\nIf you are a Bible believing Christian like me, then you have to realize that what our friend professed to believe is not what the Bible teaches.\nAnd then there was this comment:\nWater does not wash away our sins. the blood of Jesus alone does that.\nAnd then later this:\nI am a Bible believing Christian. If you say baptism can wash away sin then why would Almighty God send his Son to die? Please. You are taking scripture out of context. The thief on the cross was not baptized. I encourage baptism but to say it is necessary for salvation takes away from what Jesus did on the cross.\nLet’s take on the the first objection that water does not wash away our sins.\nTwo requirements - REPENT &amp; BAPTISM\nActs 2:38:\nBut Peter said to them: Do (REPENT) penance: and be (BAPTISM) baptized every one of you in the name of Jesus Christ, for the remission of your sins. And you shall receive the gift of the Holy Ghost.\nActs 8:26:\nNow an angel of the Lord spoke to Philip, saying: Arise, go towards the south, to the way that goeth down from Jerusalem into Gaza: this is desert.\nActs 8:27:\nAnd rising up, he went. And behold, a man of Ethiopia, an eunuch, of great authority under Candace the queen of the Ethiopians, who had charge over all her treasures, had come to Jerusalem to adore.\nActs 8:28:\nAnd he was returning, sitting in his chariot and reading Isaias the prophet.\nActs 8:29:\nAnd the Spirit said to Philip: Go near and join thyself to this chariot.\nActs 8:30:\nAnd Philip running thither, heard him reading the prophet Isaias. And he said: Thinkest thou that thou understandest what thou readest?\nActs 8:31:\nWho said: And how can I, unless some man shew me? And he desired Philip that he would come up and sit with him.\nActs 8:32:\nAnd the place of the scripture which he was reading was this: He was led as a sheep to the slaughter: and like a lamb without voice before his shearer, so openeth he not his mouth.\nActs 8:33:\nIn humility his judgment was taken away. His generation who shall declare, for his life shall be taken from the earth?\nActs 8:34:\nAnd the eunuch answering Philip, said: I beseech thee, of whom doth the prophet speak this? Of himself, or of some other man?\nWITNESS 1st\nPhillip tells the eunuch about Christ (from the Old Testament).\nActs 8:35:\nThen Philip, opening his mouth and beginning at this scripture, preached unto him Jesus.\nActs 8:36:\nAnd as they went on their way, they came to a certain water. And the eunuch said: See, here is water: What doth hinder me from being baptized?\nAsks if he believes, 2nd\nActs 8:37:\nAnd Philip said: If thou believest with all thy heart, thou mayest. And he answering, said: I believe that Jesus Christ is the Son of God.\nWater Baptism, 3rd\nActs 8:38:\nAnd he commanded the chariot to stand still. And they went down into the water, both Philip and the eunuch. And he baptized him.\nActs 8:39:\nAnd when they were come up out of the water, the Spirit of the Lord took away Philip: and the eunuch saw him no more. And he went on his way rejoicing.\nBAPTISM WASHES AWAY SIN\nActs 22:16:\nAnd now why tarriest thou? Rise up and be baptized and wash away thy sins, invoking his name.\nActs shows us that there is more than one thing required for salvation.\n\nWitness and acceptance. Phillip witnesses to the eunuch. The eunuch hears and accepts.\nThe eunuch is Baptized.\nOur sins are in fact washed away by baptism.\n\nWhat did not happen?\nAfter the eunuch believed what Phillip witnessed to him, Phillip did not say “Well you are saved because you believed”. He also did not say “Stop the chariot and pray the sinners prayer with me”.\nThere were two works that needed to be done. He had to believe and then be baptized. And note that Phillip put a qualifier on baptism. Phillip says “IF you believe with all your heart”, so baptism is conditional too. It’s not good enough to say you believe, you have to do so with all your heart.\nRomans 6: 3 Know you not that all we who are baptized in Christ Jesus are baptized in his death?\n4 For we are buried together with him by baptism into death: that, as Christ is risen from the dead by the glory of the Father, so we also may walk in newness of life.\nTake note that Paul doesn’t say, you are saved because you believe. He does however say explicitly that a work - baptism - is what causes us to have a new life.\nYou are positively not saved by faith alone and those espousing that are not Bible believing Christians because clearly the Bible does not teach that. Faith is a necessary requirement but is not the only requirement.\nThe Thief on The Cross Objection\nIf you are before Jesus and He forgives you, because He is God The Father, God The Son, and God The Holy Spirit, then there is nothing more needed. During the Mass we say “… Lord, I am not worthy that thou shouldst enter under my roof; but only say the word, and my servant shall be healed.” Matthew 8:8 Christ has that power, no one else. So unless you were forgiven directly by Christ, you should get baptized with water.\nMark 16:15-16\n15 And he said unto them,  Go ye into all the world, and preach the gospel to every creature.\n16 He that believeth and is baptized shall be saved; but he that believeth not shall be damned."},"What-an-AG-Veto-would-do":{"title":"What an AG Veto would do","links":[],"tags":[],"content":""},"about":{"title":"About","links":["Books","King-James-Bible","privacy"],"tags":[],"content":"My name is Norman Bauer.\nI have many interests such as my wife &amp; our kids (2 girls), outdoors stuff, canning, long term food storage, cryptocurrency, precious metals, Austrian Economics, libertarianism, agorism, the US Constitution, electronics, programming, computer repair, virtualization, Linux, Linux Containers, networking, Books, UFO’s, music, radio’s (CB, AM, Shortwave, and some HAM stuff too), King James Bible,Catholicism, Christian Apologetics, The Early Church Fathers, and a lot more. I’ll likely touch on all of these and more here.\nI am also a privacy advocate. I believe as the founders of the United States did, that privacy is a fundamental Right. Which is why this blog is a actually a static site instead of a WordPress or other CMS site. For the same reason you will not find Google Analytics or Facebook Pixel on this site.\nThank you for visiting.\nNorm"},"index":{"title":"Welcome to normanbauer.me","links":["Books","Bible-Notes","Obsidian","m2","News-Sites","privacy","media"],"tags":[],"content":"TOC\n\nBooks - I’m a book worm.\nBible Notes\nObsidian\nm2 - Tracking M2 Money Supply\nNews Sites - Sites I visit often to get news and information\nprivacy - Information about privacy, 1st &amp; 4th Amendment advocacy\nmedia - some media appearance by me.\n"},"m2":{"title":"M2","links":[],"tags":[],"content":"The chart below is produced using the numbers from The St Louis Federal Reserve Bank. They are in charge of reporting on the money supply.\nOn March 16, 2020 the M2 stock was 15,726 billion USD.\nAs of July 27th, 2020 the M2 stock was 18286 billion USD.\nThat represents a 14% increase in the money supply in a matter of 4 months.\n\nREAL INFLATION = 25.14% from 04/16/20 - 02/01/21\n\n\nWhat is M- Stock?\nIn banking the supply of money and credit is broken down into three catagories.\nM1\n\nM1 includes funds that are readily accessible for spending. M1 consists  of: (1) currency outside the U.S. Treasury, Federal Reserve Banks, and  the vaults of depository institutions; (2) traveler’s checks of nonbank  issuers; (3) demand deposits; and (4) other checkable deposits (OCDs),  which consist primarily of negotiable order of withdrawal (NOW) accounts at depository institutions and credit union share draft accounts.  Seasonally adjusted M1 is calculated by summing currency, traveler’s  checks, demand deposits, and OCDs, each seasonally adjusted separately.\n\nM2\n\nM2 includes a broader set of financial assets held principally by  households. M2 consists of M1 plus: (1) savings deposits (which include  money market deposit accounts, or MMDAs); (2) small-denomination time  deposits (time deposits in amounts of less than $100,000); and (3)  balances in retail money market mutual funds (MMMFs). Seasonally  adjusted M2 is computed by summing savings deposits, small-denomination  time deposits, and retail MMMFs, each seasonally adjusted separately,  and adding this result to seasonally adjusted M1.\n\nM3 - Discontinuted\nFrom Investopidia\n\nM3 is a measure of the money supply that includes M2 as well as large time deposits, institutional money market funds, short-term repurchase agreements and larger liquid assets. The M3 measurement includes assets that are less liquid than other  components of the money supply and are referred to as “near, near  money,” which are more closely related to the finances of larger  financial institutions and corporations than to those of small  businesses and individuals\n\nM3 is no longer counted by the Federal Reserve. There are some private people who try to recreate a best guess of M3 such as John Williams from Shadow Stats. However the statistics they provide are best guess and should be viewd as a guide rather than relied upon as accurate.\nWhy is M2 important?\nSince M2 includes the money supply from M1, it is a great indicator of just how much inflation is injected directly into the economy. Inflations is defined as an increase in the money supply. By looking at M2, we can see just how much prices for goods and services will rise.\nFor instance, when the Federal Reserve through its Open Markets Operations (FOMO) and Open Markets Comitte (FOMC) bailed out Wall Steet and banks, they did so by injecting money into the M3 money supply. As such asset prices for Stocks and housing, which are largely dependent on credit, rose. However because that money did not come into the M2 supply goods and services remained relativly low (4.5% increase annually)\nNow is the time to pay close attention to M2. Understanding M2 will help you know where to put your money to keep it safe. Particularly if you do not have a lot of money, understaning M2 will let you know what you are going to need to buy excess of because the price of goods will increase in the future."},"media":{"title":"Media","links":[],"tags":[],"content":"I recently had my first radio interview and I hope it is not the last. Given that, I thought it would be a good idea to keep a running tally.\n\n\nKyle O’Donnell and I speak about what I would like to see the LP take the lead on in 2021\n\n\nJuly 22, 2020 - Colorado Front Range Hour on 1360khnc.com The Roar of The Rockies. Hosts Jason, Bryan, Glen have me on to discuss the Portland Protests and Constitutionality of federal police. Click here to listen to the interview.\n\n\nAugust 22, 2017 - WBOC - Neighbors React to Easton Recovery Home -\n\n"},"movies/classic-horror":{"title":"My Classic Horror Movies List To Watch","links":[],"tags":[],"content":"I have been a fan of the classic horror genre for a long time. Franenstein, Dracula, and so on. Surprisngly to me I have only watched a couple of the Universal movies. What I have watched the most of is the Public Domain horror classics.\nWanting to keep a record of what I have watched and keep track of it, I thought a spreadsheet would be good. So I found a list of 100 Univerdal Horror films and did a webscrape using Python, to dump them into a CSV that I could then import into Excel and start tracking. While I was there I thought why not dump it into JSON &amp; YAML at that same time and then I could share the list on my blog as well.\nThe part that I thought was going to be the easiest turned out to be the most annoying, getting the data into Hugo. I will give that it’s own post later as well as spruce this page up a bit more.\nYou can grab the code on my Github repository to track your own.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRankTitleYearStatus1The Phantom Melody(1920)Haven’t seen this one yet.2The Shock(1923)Haven’t seen this one yet.3Legally Dead(1923)Haven’t seen this one yet.4The Hunchback of Notre Dame(I) (1923)Haven’t seen this one yet.5The Untameable(1923)Haven’t seen this one yet.6The Phantom of the Opera(1925)Haven’t seen this one yet.7The Cat and the Canary(1927)Haven’t seen this one yet.8The Last Performance(1929)Haven’t seen this one yet.9The Man Who Laughs(1928)Haven’t seen this one yet.10The Last Warning(1928)Haven’t seen this one yet.11The Mysterious Dr. Fu Manchu(1929)Haven’t seen this one yet.12The Return of Dr. Fu Manchu(1930)Haven’t seen this one yet.13The Cat Creeps(1930)Haven’t seen this one yet.14La voluntad del muerto(1930)Haven’t seen this one yet.15Dracula(1931)I have watched this one.16Drácula(1931)Haven’t seen this one yet.17Murder by the Clock(1931)Haven’t seen this one yet.18Daughter of the Dragon(1931)Haven’t seen this one yet.19Frankenstein(1931)I have watched this one.20Murders in the Rue Morgue(1932)Haven’t seen this one yet.21The Miracle Man(1932)Haven’t seen this one yet.22The Old Dark House(1932)Haven’t seen this one yet.23Island of Lost Souls(1932)Haven’t seen this one yet.24The Mummy(1932)Haven’t seen this one yet.25Murders in the Zoo(1933)Haven’t seen this one yet.26Terror Aboard(1933)Haven’t seen this one yet.27Supernatural(1933)Haven’t seen this one yet.28Secret of the Blue Room(1933)Haven’t seen this one yet.29White Woman(1933)Haven’t seen this one yet.30The Invisible Man(1933)Haven’t seen this one yet.31Death Takes a Holiday(1934)Haven’t seen this one yet.32The Witching Hour(1934)Haven’t seen this one yet.33The Black Cat(1934)Haven’t seen this one yet.34Double Door(1934)Haven’t seen this one yet.35Menace(I) (1934)Haven’t seen this one yet.36Secret of the Chateau(1934)Haven’t seen this one yet.37The Man Who Reclaimed His Head(1934)Haven’t seen this one yet.38Life Returns(1935)Haven’t seen this one yet.39Mystery of Edwin Drood(1935)Haven’t seen this one yet.40Night Life of the Gods(1935)Haven’t seen this one yet.41The Bride of Frankenstein(1935)I have watched this one.42The Scoundrel(1935)Haven’t seen this one yet.43Werewolf of London(1935)Haven’t seen this one yet.44The Raven(1935)Haven’t seen this one yet.45The Great Impersonation(1935)Haven’t seen this one yet.46The Invisible Ray(1936)Haven’t seen this one yet.47The Preview Murder Mystery(1936)Haven’t seen this one yet.48Dracula’s Daughter(1936)Haven’t seen this one yet.49Night Key(1937)Haven’t seen this one yet.50The Black Doll(1938)Haven’t seen this one yet.51The Missing Guest(1938)Haven’t seen this one yet.52Mars Attacks the World(1938)Haven’t seen this one yet.53Son of Frankenstein(1939)Haven’t seen this one yet.54The House of Fear(1939)Haven’t seen this one yet.55The Cat and the Canary(1939)Haven’t seen this one yet.56Tower of London(1939)Haven’t seen this one yet.57The Invisible Man Returns(1940)Haven’t seen this one yet.58The House of the Seven Gables(1940)Haven’t seen this one yet.59Black Friday(1940)Haven’t seen this one yet.60Dr. Cyclops(1940)Haven’t seen this one yet.61The Ghost Breakers(1940)Haven’t seen this one yet.62The Mummy’s Hand(1940)Haven’t seen this one yet.63Dark Streets of Cairo(1940)Haven’t seen this one yet.64The Invisible Woman(1940)Haven’t seen this one yet.65The Mad Doctor(1940)Haven’t seen this one yet.66The Monster and the Girl(1941)Haven’t seen this one yet.67Horror Island(1941)Haven’t seen this one yet.68Man Made Monster(1941)Haven’t seen this one yet.69The Black Cat(1941)Haven’t seen this one yet.70Hold That Ghost(1941)Haven’t seen this one yet.71The Wolf Man(1941)Haven’t seen this one yet.72Among the Living(1941)Haven’t seen this one yet.73The Mad Doctor of Market Street(1942)Haven’t seen this one yet.74The Ghost of Frankenstein(1942)Haven’t seen this one yet.75The Strange Case of Doctor Rx(1942)Haven’t seen this one yet.76Mystery of Marie Roget(1942)Haven’t seen this one yet.77Invisible Agent(1942)Haven’t seen this one yet.78Sherlock Holmes and the Voice of Terror(1942)Haven’t seen this one yet.79Night Monster(1942)Haven’t seen this one yet.80The Mummy’s Tomb(1942)Haven’t seen this one yet.81Sherlock Holmes and the Secret Weapon(1942)Haven’t seen this one yet.82Frankenstein Meets the Wolf Man(1943)Haven’t seen this one yet.83Sherlock Holmes in Washington(1943)Haven’t seen this one yet.84Captive Wild Woman(1943)Haven’t seen this one yet.85Phantom of the Opera(1943)Haven’t seen this one yet.86Sherlock Holmes Faces Death(1943)Haven’t seen this one yet.87Flesh and Fantasy(1943)Haven’t seen this one yet.88Son of Dracula(1943)Haven’t seen this one yet.89Henry Aldrich Haunts a House(1943)Haven’t seen this one yet.90The Mad Ghoul(1943)Haven’t seen this one yet.91Calling Dr. Death(1943)Haven’t seen this one yet.92The Spider Woman(1943)Haven’t seen this one yet.93The Uninvited(1944)Haven’t seen this one yet.94Weird Woman(1944)Haven’t seen this one yet.95The Scarlet Claw(1944)Haven’t seen this one yet.96Ghost Catchers(1944)Haven’t seen this one yet.97Jungle Woman(1944)Haven’t seen this one yet.98The Invisible Man’s Revenge(1944)Haven’t seen this one yet.99The Mummy’s Ghost(1944)Haven’t seen this one yet.100The Pearl of Death(1944)Haven’t seen this one yet."},"movies/westerns":{"title":"My Western Movie List To Watch","links":["'movies/classic-horror/'"],"tags":[],"content":"Just like my Classic Horror Movies List Westerns are another genere that I love. I tend to like more modern Westerns like Young Guns (which is not on the list for some reason), Django Unchained, and Wyatt Earp. However there are some gems in the original Westerns so I am going to be watching them.\nGoing down the list I was surprised at just how many I had already watched. I guess it is one of those genres that creeps up on you if you are of certain age.\nIf the status is “All quiet on the Western Front” I have not seen it and if it is “I’m your huckleberry” I have watched it.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRankTitleYearStatus1Once Upon a Time in the West(1968)All quiet on the Western Front.2The Searchers(1956)All quiet on the Western Front.3Red River(1948)All quiet on the Western Front.4High Noon(1952)All quiet on the Western Front.5Shane(1953)All quiet on the Western Front.6Unforgiven(1992)I’m your huckleberry.7Johnny Guitar(1954)All quiet on the Western Front.8The Wild Bunch(1969)All quiet on the Western Front.9Bad Day at Black Rock(1955)All quiet on the Western Front.10Greed(1924)All quiet on the Western Front.11Stagecoach(1939)All quiet on the Western Front.12McCabe &amp; Mrs. Miller(1971)All quiet on the Western Front.13No Country for Old Men(2007)All quiet on the Western Front.14They Died with Their Boots On(1941)All quiet on the Western Front.15Will Penny(1967)All quiet on the Western Front.16The Treasure of the Sierra Madre(1948)All quiet on the Western Front.17Butch Cassidy and the Sundance Kid(1969)I’m your huckleberry.18The Ox-Bow Incident(1942)I’m your huckleberry.19The Man Who Shot Liberty Valance(1962)I’m your huckleberry.20Monte Walsh(1970)All quiet on the Western Front.21Broken Arrow(1950)All quiet on the Western Front.22My Darling Clementine(1946)All quiet on the Western Front.23Lonely Are the Brave(1962)All quiet on the Western Front.24Rancho Notorious(1952)All quiet on the Western Front.25Fort Apache(1948)All quiet on the Western Front.26She Wore a Yellow Ribbon(1949)All quiet on the Western Front.27Rio Grande(1950)All quiet on the Western Front.28The Gunfighter(1950)All quiet on the Western Front.29Rio Bravo(1959)All quiet on the Western Front.30Winchester ‘73(1950)All quiet on the Western Front.31Hondo(1953)All quiet on the Western Front.32The Man from Laramie(1955)All quiet on the Western Front.33Ulzana’s Raid(1972)All quiet on the Western Front.34Blood on the Moon(1948)All quiet on the Western Front.35Major Dundee(1965)All quiet on the Western Front.36The Magnificent Seven(1960)All quiet on the Western Front.37The Naked Spur(1953)All quiet on the Western Front.38A Fistful of Dollars(1964)I’m your huckleberry.39For a Few Dollars More(1965)I’m your huckleberry.40The Good, the Bad and the Ugly(1966)I’m your huckleberry.41Bend of the River(1952)All quiet on the Western Front.42Tumbleweeds(1925)All quiet on the Western Front.43Hombre(1967)All quiet on the Western Front.44Hud(1963)All quiet on the Western Front.45Don’t Fence Me In(1945)All quiet on the Western Front.46Dodge City(1939)All quiet on the Western Front.47The Big Sky(1952)All quiet on the Western Front.48Ride the High Country(1962)All quiet on the Western Front.49Open Range(2003)All quiet on the Western Front.50The Westerner(1940)All quiet on the Western Front.51The Last of the Mohicans(1992)I’m your huckleberry.52The Shootist(1976)All quiet on the Western Front.53Destry Rides Again(1939)All quiet on the Western Front.54The Professionals(1966)All quiet on the Western Front.55Tall in the Saddle(1944)All quiet on the Western Front.56Ride Lonesome(1959)All quiet on the Western Front.57The Plainsman(1936)All quiet on the Western Front.58Cat Ballou(1965)All quiet on the Western Front.59The Tall T(1957)All quiet on the Western Front.60Jesse James(1939)All quiet on the Western Front.61Little Big Man(1970)All quiet on the Western Front.62Riders of the Purple Sage(1996 TV Movie)All quiet on the Western Front.63The Alamo(1960)All quiet on the Western Front.64The Far Country(1954)All quiet on the Western Front.653 Godfathers(1948)All quiet on the Western Front.66Appaloosa(2008)All quiet on the Western Front.67Forty Guns(1957)All quiet on the Western Front.683:10 to Yuma(1957)I’m your huckleberry.69Gunfight at the O.K. Corral(1957)All quiet on the Western Front.70Sergeant Rutledge(1960)All quiet on the Western Front.71Little Big Horn(1951)All quiet on the Western Front.727 Men from Now(1956)All quiet on the Western Front.73Santa Fe Trail(1940)All quiet on the Western Front.74The Paleface(1948)All quiet on the Western Front.75Angel and the Badman(1947)All quiet on the Western Front.76Duel in the Sun(1946)All quiet on the Western Front.77How the West Was Won(1962)All quiet on the Western Front.78The Big Trail(1930)All quiet on the Western Front.79Paint Your Wagon(1969)All quiet on the Western Front.80Tombstone(1993)I’m your huckleberry.81Hearts of the West(1975)All quiet on the Western Front.82Hang ‘Em High(1968)I’m your huckleberry.83Ten Wanted Men(1955)All quiet on the Western Front.84The Virginian(1929)All quiet on the Western Front.85Lone Star(1996)All quiet on the Western Front.86Run of the Arrow(1957)All quiet on the Western Front.87The Vanishing American(1925)All quiet on the Western Front.88The Outlaw Josey Wales(1976)I’m your huckleberry.89Jeremiah Johnson(1972)All quiet on the Western Front.90Cowboy(1958)All quiet on the Western Front.91Barbarosa(1982)All quiet on the Western Front.92One-Eyed Jacks(1961)All quiet on the Western Front.93Bad Company(1972)All quiet on the Western Front.94Ramrod(1947)All quiet on the Western Front.95The Long Riders(1980)All quiet on the Western Front.96The Missing(I) (2003)All quiet on the Western Front.97Four Faces West(1948)All quiet on the Western Front.98The Ballad of Little Jo(1993)All quiet on the Western Front.99The Covered Wagon(1923)All quiet on the Western Front.100No Name on the Bullet(1959)All quiet on the Western Front."},"privacy":{"title":"Privacy","links":["Exploring-MysticBBS"],"tags":[],"content":"From the rapid adoption of the Internet in the early 90’s all the way up to about 2012, the Internet was awesome. Not because of the technology that it ran on, but because it was free as in Libra. You were not counted, numbered, or tracked, and if you were it was out of the ordinary.\nThen In-Q-Tel dropped billions of $USD into Google, Facebook, and other social media companies and the Internet became one big psyop.\nI wan’t to explore the possibilities of getting back to what we once had.\nExploring MysticBBS"}}